"use strict";
// для установки языка в терминале нужно набрать команду npm install -g typescript
// флаг -g означает что установка компилятора языка проходит глобально на компьютер, а не в рамках одной папки
// для того чтобы проверить версию компилятора в терминале нужно ввести команду tsc -v
//для генерации файла конфигурации запустить команду tsc --init
// 14 - стандарт языка
// 28 строка - откуда брать файлы
// 50 строка - куда поместить JS файлы
// 51 удалить закоментированные строки
// 77 - вкл/выкл строгий режим
