// функции записываются точно так же как и в JS но когда мы передаем аргументы
// мы так же указываем их тип данных и тот тип данных который функция нам вернет

// function sum (a:number, b:number) :number{
//     return a + b
// }

// если функция ничего не возвращает то используется ключевое слово void
//
// function sum2 (a:number, b:number) :void{
//     console.log(a+b)
// }

// так же бывают случаи когда функции имеют необязательные параметры

// записываются они следующим образом

// function bar (a:string, b?:number):void{
//     console.log(a,b)
// }
// bar("5", 5)